{"timeLimit":10000,"input":"Первая строка ввода содержит количество тестов $t$. Далее следуют описания $t$ тестов. Каждый тест начинается со строки, содержащей размеры коры сетки, $m$ и $n$, при этом $n$ всегда кратна 4. Следующие $m$ строк содержат строки по $n/4$ символов --- представления строк коры в шестнадцатеричном виде. Двоичное представление этих чисел даст вам строки из $n$ бит, по одному для каждой строки. Нули обозначают черные квадраты, а единицы --- белые квадраты. Строки заданы сверху вниз. В каждой строке, наиболее значимый бит  шестнадцатеричного числа соответствует крайней слева ячейке этой строки.\r\n\r\nОграничения: $1\\le t\\le 100$, $n$ делится на 4.\r\n\r\nВ задаче 1: $1\\le n, m\\le 32$.\r\n\r\nВ задаче 2: $1\\le n, m\\le 512$.\r\n","sampleTests":[{"input":"4\r\n15 20\r\n55555\r\nFFAAA\r\n2AAD5\r\nD552A\r\n2AAD5\r\nD542A\r\n4AD4D\r\nB52B2\r\n52AAD\r\nAD552\r\nAA52D\r\nAAAAA\r\n5AA55\r\nA55AA\r\n5AA55\r\n4 4\r\n0\r\n0\r\n0\r\n0\r\n4 4\r\n3\r\n3\r\nC\r\nC\r\n4 4\r\n6\r\n9\r\n9\r\n6\r\n","output":"5\r\n6 2\r\n4 3\r\n3 7\r\n2 15\r\n1 57\r\n1\r\n1 16\r\n2\r\n2 1\r\n1 12\r\n1\r\n2 4\r\n"}],"legend":"Как известно, шахматные доски делают из коры крайне редкого хорватского шахматного дерева (Biggus Mobydiccus). Кору этого дерева сняли и развернули в огромный прямоугольный лист из черных и белых квадратов. Из этого листа на фабрике сделают несколько шахматных досок разного размера. Шахматной доской называется квадратный кусок коры со сторонами, параллельными сторонам прямоугольника, у которого никакие две соседние по стороне клетки не имеют одинаковый цвет.\r\n\r\nДоски вырезают с помощью жадного алгоритма: каждый раз вырезаю максимальную по размеру шахматную доску, если есть несколько таких, выбирают самую верхний, а среди таких --- самую левую. Доски вырезают, пока весь лист не кончится. Возможно, даже дойдет до того, что будут вырезаны нано-доски $1\\times 1$.\r\n\r\nВот пример, показывающий лист коры доска и первые семь шахматных досок, которые будут из него вырезаны.\r\n\r\n\\begin{center}\r\n\\includegraphics[width=10cm,natwidth=400,natheight=300]{image.jpg}\r\n\\end{center}\r\n\r\nВам дано описание листа коры шахматного дерева. Посчитайте, сколько и каких досок получится из него в конце процесса.","outputFile":"stdout","name":"Шахматные доски","authorName":"Pavel Mavrin","inputFile":"stdin","tutorial":"","language":"russian","notes":"","output":"Для каждого теста выведите строку, содержащую число $k$ --- число различных размеров шахматной досок, которые будут вырезаны, следуя процедуре, описанной выше. Следующие $k$ строк должны содержать по два целых числа --- размер шахматной доски (от большего к меньшему) и количество шахматных досок такого размера, которые будут вырезаны.","authorLogin":"pashka","memoryLimit":67108864}